In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [3]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [5]:
"""
pickle : 파이썬 객체를 파일로 저장(텍스트로 저장x)
텍스트 수집 -> 정제 -> 분석 -> 시각화 -> (모델링) -> 유지보수
ex) 10기가바이트(raw text) -> parsing -> 분석 대상 텍스트만 추출 -> dict, list 등에 저장
pickle 모듈 : 파이썬 객체(dict, list, df, series, ...)에 저장된 정제된 텍스트를 바이너리 형식으로 파일에 저장
(속도 빠름, 용량 작음)
"""

'\npickle : 파이썬 객체를 파일로 저장(텍스트로 저장x)\n텍스트 수집 -> 정제 -> 분석 -> 시각화 -> (모델링) -> 유지보수\nex) 10기가바이트(raw text) -> parsing -> 분석 대상 텍스트만 추출 -> dict, list 등에 저장\npickle 모듈 : 파이썬 객체(dict, list, df, series, ...)에 저장된 정제된 텍스트를 파일로 저장 \n'

In [6]:
import pickle

In [8]:
myList=['a', 'b']

In [9]:
with open('pic_ex1.pickle', 'wb') as f:
    pickle.dump(myList, f)

In [10]:
with open("pic_ex1.pickle","rb") as f:
    myData=pickle.load(f)

In [11]:
myData

['a', 'b']

In [15]:
price = pd.read_pickle('data/examples/yahoo_price.pkl')
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [16]:
volume = pd.read_pickle('data/examples/yahoo_volume.pkl')
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [17]:
volume.to_pickle('pic_ex2.pkl')

In [18]:
returns = price.pct_change() # (현재행-이전행)/현재행
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [19]:
# 다음주 월요일(분산, 공분산, 상관계수(분석))
returns['AAPL'].corr(returns['GOOG'])

0.4079185761679696

In [20]:
returns['AAPL'].corr(returns['IBM'])

0.38681743611391

In [21]:
returns['AAPL'].corr(returns['MSFT'])

0.38969458628057835

In [22]:
returns.corr() # 상관관계

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [23]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [25]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [26]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [27]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [29]:
obj.value_counts() # 시리즈.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [31]:
obj.to_numpy() # 시리즈 -> 넘파이 배열

array(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], dtype=object)

In [33]:
pd.value_counts(obj.to_numpy()) # 출력은 가능, 기본 내림차순 정렬

c    3
a    3
b    2
d    1
dtype: int64

In [34]:
pd.value_counts(obj.to_numpy(), sort=False) # 출력은 가능, 정렬x

c    3
a    3
d    1
b    2
dtype: int64

In [35]:
pd.value_counts(obj.to_numpy(), ascending=True) # 출력은 가능, 오름차순정렬

d    1
b    2
c    3
a    3
dtype: int64

In [36]:
obj.value_counts(ascending=True)

d    1
b    2
c    3
a    3
dtype: int64

In [37]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [39]:
obj.value_counts(sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [41]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [42]:
'a' in obj

False

In [44]:
1 in obj
9 in obj

False

In [48]:
obj[obj.isin(['b','c'])]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [49]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [50]:
unique_vals = pd.Series(["c", "b", "a"])
unique_vals

0    c
1    b
2    a
dtype: object

In [51]:
pd.Index(unique_vals)

Index(['c', 'b', 'a'], dtype='object')

In [52]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [54]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match)
indices
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [55]:
# 데이터프레임, 행렬
# 공통점 : 2차원
# 차이점 : 행렬(모든 자료의 타입이 동일), 데이터프레임(모든 자료의 타입이 동일하지 않아도 됨, 각 열은 동일 타입)

In [57]:
# 리스트, 벡터(1차원)
# 차이점 : 리스트 다양한 타입, 벡터 동일한 타입
# myLIst=[1,'a',2.1,True]
# np.array([1,'a']) -> array(['1', 'a'])로 통일됨

In [58]:
data['Qu1'].value_counts()

3    2
4    2
1    1
Name: Qu1, dtype: int64

In [59]:
data['Qu1'].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [68]:
data
# 모든 열 단위로 각 숫자의 빈도수를 출력
data[:].value_counts()
data.value_counts()

Qu1  Qu2  Qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
dtype: int64

In [69]:
data['Qu1'].value_counts()

3    2
4    2
1    1
Name: Qu1, dtype: int64

In [70]:
# def f1(x):
#     return x.max()-x.min()
# frame.apply(f1)

In [71]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [74]:
# def aaa(x):
#     return x.value_counts()

# data.apply(aaa)

data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [75]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [76]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
dtype: int64

In [77]:
df = pd.read_csv('data/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [79]:
#cat data/examples/ex1.csv

In [81]:
df2 = pd.read_csv('data/examples/ex2.csv', header=None)
df2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [82]:
df2 = pd.read_csv('data/examples/ex2.csv', header=None, names=['a', 'b', 'c', 'd', 'msg'])
df2

   a   b   c   d    msg
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [86]:
df=pd.read_csv("data/examples/ex2.csv", header=None, names=['a','b','c','d','msg'], index_col='msg')
df
#index_col : 특정 열의 값을 행 인덱스 라벨로 설정

       a   b   c   d
msg
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

In [88]:
pd.read_csv("data/examples/csv_mindex.csv")

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [91]:
df = pd.read_csv("data/examples/csv_mindex.csv", index_col = ['key1', 'key2'])
df

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [94]:
df = pd.read_csv("data/examples/ex3.txt")
df

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [96]:
df.loc[1:3]

               A         B         C
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [99]:
df = pd.read_csv("data/examples/ex3.txt", sep='\s+')
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [105]:
df.loc[1]

a              5
b              6
c              7
d              8
message    world
Name: 1, dtype: object

In [103]:
df=pd.read_csv("data/examples/ex4.csv", skiprows=[0,2,3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [107]:
df=pd.read_csv('data/examples/ex5.csv')
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [112]:
df=pd.read_csv('data/examples/ex5.csv').fillna('NULL')
df
df=pd.read_csv('data/examples/ex5.csv').fillna('AAA')
df

  something  a   b     c   d message
0       one  1   2   3.0   4     AAA
1       two  5   6   AAA   8   world
2     three  9  10  11.0  12     foo

In [113]:
df=pd.read_csv('data/examples/ex5.csv', na_values=['world'])
df
# na_values는 리스트에 담긴 특정 문자(열)에 해당되는 데이터에 대해 결측값으로 읽어지도록 하는 옵션

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8     NaN
2     three  9  10  11.0  12     foo

In [116]:
df=pd.read_csv('data/examples/ex5.csv', na_values=['9', '10', '?'])
df

  something    a    b     c   d message
0       one  1.0  2.0   3.0   4     NaN
1       two  5.0  6.0   NaN   8   world
2     three  NaN  NaN  11.0  12     foo

In [119]:
df=pd.read_csv('data/examples/ex5.csv')
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [120]:
# df=pd.read_csv('data/examples/ex5.csv', na_filter=True)
# df+

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [124]:
df=pd.read_csv("data/examples/ex5.csv", na_values=['one', 'foo'])
df

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [126]:
df=pd.read_csv("data/examples/ex6.csv")
df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     10000 non-null  float64
 1   two     10000 non-null  float64
 2   three   10000 non-null  float64
 3   four    10000 non-null  float64
 4   key     10000 non-null  object
dtypes: float64(4), object(1)
memory usage: 390.8+ KB

In [127]:
# 부족한 메모리, 빅 데이터 읽기 방법
# 1) 큰 메모리를 구매
# 2) 분산 환경 구성
# 3) 빅 데이터를 쪼개서 읽기(해당 방법 사용)

# chksize = 1000 # 한번에 1천개씩 데이터 읽기
# for cnt, chunk in enumerate(pd.read_csv('파일명', chunksize=chksize)):
    # 처리작업(chunk)

In [135]:
chker = pd.read_csv('data/examples/ex6.csv', chunksize=1000)
type(chker)

pandas.io.parsers.readers.TextFileReader

In [136]:
chker

In [137]:
chker = pd.read_csv('data/examples/ex6.csv', chunksize=1000)
for piece in chker:
    print(piece['key'].value_counts())
    print('='*50)

S    48
O    44
F    40
H    39
Q    39
J    39
G    38
R    38
X    37
I    37
V    35
U    33
D    32
E    32
W    31
L    31
K    31
A    30
M    29
Y    28
T    27
N    27
C    27
Z    26
B    25
P    25
7    17
6    17
4    17
3    15
8    13
1    13
2    11
9    11
0     9
5     9
Name: key, dtype: int64
==================================================
O    48
L    44
X    40
I    39
R    38
F    37
Q    35
D    34
V    33
K    33
E    32
H    31
J    31
T    31
A    31
U    30
N    30
Z    30
M    28
S    27
Y    27
G    26
P    26
W    25
B    24
C    23
5    20
0    19
9    19
8    19
4    18
1    16
3    16
2    14
6    14
7    12
Name: key, dtype: int64
==================================================
A    40
O    40
X    39
E    39
M    38
H    37
T    36
G    36
K    34
L    34
U    33
F    32
B    32
N    31
V    31
S    30
P    30
Z    29
W    29
J    29
D    28
R    28
Q    28
Y    27
C    27
I    25
6    20
0    19
9    19
7    18
3    15
2    14
4    14
8    14
5    14
1    11
Name: key, dtype: int64
==================================================
X    43
J    41
V    38
Q    38
D    38
C    37
E    37
N    36
P    35
B    35
F    35
L    33
S    32
K    32
R    31
A    31
M    30
H    30
O    29
Y    28
W    28
I    28
G    27
U    26
Z    24
T    23
5    21
6    18
3    17
1    16
2    16
0    15
9    15
8    13
4    12
7    12
Name: key, dtype: int64
==================================================
E    54
Q    42
L    40
H    39
P    38
K    38
M    36
X    35
Y    35
D    34
W    33
U    33
N    33
I    31
T    31
Z    31
F    31
A    31
G    30
B    27
V    26
O    26
C    26
J    25
S    24
2    20
4    18
R    18
0    18
3    18
5    17
6    17
8    16
7    13
9     8
1     8
Name: key, dtype: int64
==================================================
Y    42
F    41
K    41
X    38
V    37
L    35
W    35
E    35
J    34
M    33
R    33
P    32
N    32
U    32
I    32
D    31
S    31
B    30
G    28
H    28
Q    27
O    26
A    25
1    25
C    25
T    24
Z    23
5    22
9    20
7    20
6    17
8    17
3    16
4    13
2    12
0     8
Name: key, dtype: int64
==================================================
L    41
C    41
Z    39
W    39
X    38
O    37
I    36
T    36
R    35
H    34
J    33
N    32
G    31
D    31
F    31
P    30
E    30
B    30
V    30
U    29
M    29
Q    28
8    25
Y    24
A    23
K    22
7    22
S    21
9    20
0    18
4    18
2    17
1    16
5    15
3    11
6     8
Name: key, dtype: int64
==================================================
J    42
M    40
X    39
E    39
D    39
A    38
V    38
G    37
P    35
Q    35
R    34
L    34
H    34
B    34
Y    33
I    33
O    32
U    30
N    29
T    28
K    27
F    26
S    26
C    26
W    25
Z    22
6    21
4    19
8    18
2    16
7    14
0    14
3    13
5    13
1    12
9     5
Name: key, dtype: int64
==================================================
O    42
U    41
S    40
A    39
V    37
E    35
T    35
P    35
J    34
K    34
M    34
Q    34
I    33
Z    33
Y    32
W    32
B    32
R    29
F    29
D    28
N    27
X    27
C    26
H    25
L    24
G    24
7    22
4    21
9    18
1    17
2    17
3    15
0    14
6    12
8    12
5    11
Name: key, dtype: int64
==================================================
K    42
M    41
U    39
Y    38
P    38
E    35
R    34
Q    34
I    33
T    33
H    33
F    33
B    33
A    32
Z    31
G    31
L    30
N    29
S    29
J    29
C    28
W    28
X    28
3    26
D    25
V    23
6    22
4    21
O    19
0    17
2    15
9    15
8    15
5    15
7    14
1    12
Name: key, dtype: int64
==================================================

In [139]:
tot = pd.Series([], dtype='int64') # 빈 시리즈 정의, 정수가 저장될 수 있음
tot

Series([], dtype: int64)

In [138]:
ser1=pd.Series([10,20])
ser1

0    10
1    20
dtype: int64

In [141]:
# tot + ser1
tot.add(ser1, fill_value=0)

0    10.0
1    20.0
dtype: float64

In [149]:
# ex6.csv dml, key 열에 대해 문자별 빈도수를 출력하시오.
chker = pd.read_csv('data/examples/ex6.csv', chunksize=1000)
tot = pd.Series([], dtype='int64') # 빈 시리즈 정의, 정수가 저장될 수 있음
for piece in chker:
    # print(piece['key'].value_counts())
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot

0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
A    320.0
B    302.0
C    286.0
D    320.0
E    368.0
F    335.0
G    308.0
H    330.0
I    327.0
J    337.0
K    334.0
L    346.0
M    338.0
N    306.0
O    343.0
P    324.0
Q    340.0
R    318.0
S    308.0
T    304.0
U    326.0
V    328.0
W    305.0
X    364.0
Y    314.0
Z    288.0
dtype: float64

In [150]:
tot.sort_values(ascending=False)

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
V    328.0
I    327.0
U    326.0
P    324.0
D    320.0
A    320.0
R    318.0
Y    314.0
G    308.0
S    308.0
N    306.0
W    305.0
T    304.0
B    302.0
Z    288.0
C    286.0
4    171.0
6    166.0
7    164.0
8    162.0
3    162.0
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
dtype: float64

In [152]:
df = pd.read_csv('data/examples/ex7.csv')
df

   a  b  c
0  1  2  3
1  1  2  3

In [155]:
df.columns
df.index
df.values

array([[1, 2, 3],
       [1, 2, 3]], dtype=int64)

In [156]:
import csv

In [158]:
reader = csv.reader(open('data/examples/ex7.csv'))

In [159]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [160]:
 obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [161]:
import json

In [162]:
res = json.loads(obj) # obj에 저장된 딕셔너리 구조의 문자열을 읽어서 json 형식으로 변환하여 res에 저장
res

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [163]:
type(res)

dict

In [164]:
type(obj)

str

In [166]:
asjson=json.dumps(res) #res에 저장된 딕셔너리 구조의 데이터를 문자열로 저장
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [167]:
res['siblings']

[{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
 {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]

In [168]:
pd.DataFrame(res['siblings'])

    name  age            hobbies
0  Scott   34  [guitars, soccer]
1  Katie   42      [diving, art]

In [169]:
data = pd.read_json('data/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [172]:
# data frame -> csv
data.to_csv('data_to_csv.csv')

In [173]:
# data frame -> json
data.to_json()

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [174]:
data.to_json('data.to_json.json')

In [176]:
tables = pd.read_html("data/examples/fdic_failed_bank_list.html")
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [177]:
len(tables)

1

In [178]:
tables[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [179]:
pd.read_excel("data/examples/ex1.xlsx")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [182]:
pd.read_excel("data/examples/ex1.xlsx", index_col=0) # Sheet1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [183]:
pd.read_excel("data/examples/ex1.xlsx", index_col=0, sheet_name='Sheet1') # Sheet1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [185]:
df = pd.read_excel("data/examples/ex1.xlsx", index_col=0, sheet_name='Sheet2') # Sheet2
df

   q   w   e   r message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [186]:
df.to_excel('ex1_copy.xlsx', sheet_name='MySheet1')

In [188]:
# *titanic 데이터셋에 대해 다음 작업을 수행하시오.
df = pd.read_csv('data/datasets/titanic/train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [198]:
# 1. 승선항구(Embarked)가 'C'인 자료만 추출하시오.
df[df['Embarked'] == 'C']
# 2. SibSp + Parch 의 합이 0인 자료만 추출하시오.
df[df.SibSp + df.Parch == 0]
# 3. Pclass가 1인 자료만 추출하시오.
df[df['Pclass']==1]
# 4. Fare 열 값이 20이상 50미만인 자료만 추출하시오.
df[(df.Fare >= 20) & (df.Fare <50)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [215]:
# * yahoo finance 사이트 데이터셋(finance.yahoo.com)
# 5. 2024년도 삼성전자 주가데이터를 가져온 다음 아래와 같은 작업을 수행해보세요.
df = pd.read_csv('samsung2024.csv', index_col=0)
df

               Open     High      Low    Close     Adj Close    Volume
Date
2023-05-24  68100.0  68700.0  68000.0  68500.0  67485.750000   8192896
2023-05-25  69900.0  70000.0  68700.0  68800.0  67781.312500  14231160
2023-05-26  69800.0  70400.0  69500.0  70300.0  69259.093750  19549511
2023-05-30  71300.0  72300.0  71200.0  72300.0  71229.492188  27476897
2023-05-31  72400.0  72500.0  71000.0  71400.0  70342.812500  25666087
...             ...      ...      ...      ...           ...       ...
2024-05-20  78100.0  79100.0  77900.0  78900.0  78900.000000  19456783
2024-05-21  78500.0  79000.0  78200.0  78400.0  78400.000000  13690583
2024-05-22  78100.0  78700.0  77300.0  77700.0  77700.000000  19521506
2024-05-23  77700.0  79100.0  77100.0  78300.0  78300.000000  18728087
2024-05-24  76800.0  77000.0  75700.0  75900.0  75900.000000  29022071

[245 rows x 6 columns]

In [220]:
# 1) 각 열 단위로 최대값을 출력하시오.
df.max()
# 2) 각 열 단위로 최소값을 출력하시오.
df.apply(min)
# 3) 각 열 단위로 최대값-최소값을 출력하시오.
def max_min(a):
    return a.max()-a.min()
df.apply(max_min)
# 4) 기술통계를 구하시오.
# df.info()
df.describe()

,Open,High,Low,Close,Adj Close,Volume
count,245.000000,245.000000,245.00000,245.000000,245.000000,2.450000e+02
mean,73004.489796,73557.551020,72341.22449,72919.591837,72559.773055,1.599096e+07
std,4179.254513,4201.657816,4030.83079,4131.370371,4351.893952,6.855821e+06
min,66000.000000,66700.000000,65800.00000,66000.000000,65644.289063,2.957915e+06
25%,70100.000000,70800.000000,69600.00000,70300.000000,69604.726563,1.155788e+07
50%,72500.000000,72900.000000,72000.00000,72400.000000,72058.789063,1.441728e+07
75%,74600.000000,75200.000000,73700.00000,74700.000000,74646.539063,1.900701e+07
max,85200.000000,86000.000000,84500.00000,85300.000000,85300.000000,5.769127e+07